Workspace/run/18-sineWaveDamping-backward-pressureOutletNSCBC-3000hz-temperatureOutletNSCBC-zeroGradinet-velocityOutletNSCBC-fixValue-1-setFiled-1/0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
 
    outlet
    {
        type            velocityOutletNSCBC;
        field           U;
        gamma           1.4;
        fieldInf        (1 0 0);
        lInf            2.25;
        pInf            101325;
        etaAc           1;
        value           $internalField;
    }



    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
